glocklueng/032/LayerOne_2014/badge/code/stm32-prox/hw_config.c
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : hw_config.c
* Author             : MCD Application Team
* Version            : V2.2.0
* Date               : 06/13/2008
* Description        : Hardware Configuration & Setup
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include "stm32f10x_lib.h"
#include "l1_board.h"
#include "hw_config.h"
#include "usb_lib.h"
#include "usb_desc.h"
#include "usb_pwr.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define ADC1_DR_Address    ((u32)0x4001244C)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
ErrorStatus HSEStartUpStatus;

// ADC values
uint16_t   ADC_Ampl[2];
uint32_t SystemCoreClock = SYSCLK_FREQ_72MHz ;

/* Extern variables ----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

extern void DelaymS ( u32 nTime );
extern void DelayuS ( vu32 nCount );

/*******************************************************************************
* Function Name  : Set_System
* Description    : Configures Main system clocks & power.
* Input          : None.
* Return         : None.
*******************************************************************************/
int Set_System ( void )
{
	/* SYSCLK, HCLK, PCLK2 and PCLK1 configuration -----------------------------*/

	/* RCC system reset(for debug purpose) */
	RCC_DeInit();

	/* Enable HSE */
	RCC_HSEConfig ( RCC_HSE_ON );

	/* Wait till HSE is ready */
	HSEStartUpStatus = RCC_WaitForHSEStartUp();

	if ( HSEStartUpStatus == SUCCESS ) {
		/* Enable Prefetch Buffer */
		FLASH_PrefetchBufferCmd ( FLASH_PrefetchBuffer_Enable );

		/* Flash 2 wait state */
		FLASH_SetLatency ( FLASH_Latency_2 );

		/* HCLK = SYSCLK */
		RCC_HCLKConfig ( RCC_SYSCLK_Div1 );

		/* PCLK2 = HCLK */
		RCC_PCLK2Config ( RCC_HCLK_Div1 );

		/* PCLK1 = HCLK/2 */
		RCC_PCLK1Config ( RCC_HCLK_Div2 );

		/* On STICE the PLL output clock is fixed to 72 MHz */
		/*  PLL configuration: PLLCLK = HSI/1 * 9 = 72 MHz */
		RCC_PLLConfig ( RCC_PLLSource_HSE_Div1, RCC_PLLMul_9 );

		/* Enable PLL */
		RCC_PLLCmd ( ENABLE );

		/* Wait till PLL is ready */
		while ( RCC_GetFlagStatus ( RCC_FLAG_PLLRDY ) == RESET ) {
		}

		/* Select PLL as system clock source */
		RCC_SYSCLKConfig ( RCC_SYSCLKSource_PLLCLK );

		/* Wait till PLL is used as system clock source */
		while ( RCC_GetSYSCLKSource() != 0x08 ) {
		}
	}
	else {

		GPIO_InitTypeDef GPIO_InitStructure;

		// make sure peripheral is on
		RCC_APB2PeriphClockCmd ( RCC_APB2Periph_GPIO_LED, ENABLE );

		/* Configure the LED IOs as Output PP */
		GPIO_InitStructure.GPIO_Pin = LED_PIN;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;

		GPIO_Init ( LED_PORT, &GPIO_InitStructure );

		while ( 1 ) {

			GPIO_WriteBit ( LED_PORT,LED_PIN  ,Bit_RESET );
			DelayuS ( 100000 );

			GPIO_WriteBit ( LED_PORT,LED_PIN  ,Bit_SET );
			DelayuS ( 100000 );
			DelayuS ( 100000 );
			DelayuS ( 100000 );
			DelayuS ( 100000 );
		}

		return 0 ;
	}


	/* Configure the used GPIOs*/
	GPIO_Configuration();

	/* Configure the ADC*/
	ADC_Configuration();

	return 1;
}

/*******************************************************************************
* Function Name  : Set_USBClock
* Description    : Configures USB Clock input (48MHz).
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Set_USBClock ( void )
{
	/* Select USBCLK source */
	RCC_USBCLKConfig ( RCC_USBCLKSource_PLLCLK_1Div5 );

	/* Enable USB clock */
	RCC_APB1PeriphClockCmd ( RCC_APB1Periph_USB, ENABLE );
}

/*******************************************************************************
* Function Name  : Enter_LowPowerMode.
* Description    : Power-off system clocks and power while entering suspend mode.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Enter_LowPowerMode ( void )
{
	/* Set the device state to suspend */
	bDeviceState = SUSPENDED;
}

/*******************************************************************************
* Function Name  : Leave_LowPowerMode.
* Description    : Restores system clocks and power while exiting suspend mode.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Leave_LowPowerMode ( void )
{
	DEVICE_INFO *pInfo = &Device_Info;

	/* Set the device state to the correct state */
	if ( pInfo->Current_Configuration != 0 ) {
		/* Device configured */
		bDeviceState = CONFIGURED;
	}

	else {
		bDeviceState = ATTACHED;
	}
}

/*******************************************************************************
* Function Name  : USB_Interrupts_Config.
* Description    : Configures the USB interrupts.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void USB_Interrupts_Config ( void )
{
	NVIC_InitTypeDef NVIC_InitStructure;

	memset ( &NVIC_InitStructure,0,sizeof ( NVIC_InitStructure ) );

	// USB Interrupt
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN_RX0_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init ( &NVIC_InitStructure );
}

