glocklueng/032/LayerOne_2014/badge/code/stm32-prox/hw_config.c
/*******************************************************************************
* Function Name  : USB_Cable_Config.
* Description    : Software Connection/Disconnection of USB Cable.
* Input          : NewState: new state.
* Output         : None.
* Return         : None
*******************************************************************************/
void USB_Cable_Config ( FunctionalState NewState )
{

#ifdef USB_DISCONNECT_PORT

	if ( NewState != DISABLE ) {
		GPIO_SetBits ( USB_DISCONNECT_PORT, USB_DISCONNECT_PIN );
	}

	else {
		GPIO_ResetBits ( USB_DISCONNECT_PORT, USB_DISCONNECT_PIN );
	}

#endif

}

/*
    GPIO_Mode_AIN           ;Analog in
    GPIO_Mode_IN_FLOATING   ;input floating (save more power compare to IPD or IPU - use if appropriate)
    GPIO_Mode_IPD           ;input pulled down
    GPIO_Mode_IPU           ;input pulled up

*/

/*******************************************************************************
* Function Name  : GPIO_Configuration
* Description    : Configures the different GPIO ports.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void GPIO_Configuration ( void )
{
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd (
#ifdef RCC_APB2Periph_GPIO_DISCONNECT
	    RCC_APB2Periph_GPIO_DISCONNECT |
#endif
	    RCC_APB2Periph_GPIOA |
	    RCC_APB2Periph_GPIOB |
	    RCC_APB2Periph_GPIOC |
	    RCC_APB2Periph_GPIOD,
	    ENABLE );



	// Disable JTRST , i want to use it for a USB D+ Pull Up (didn't work!)
	GPIO_PinRemapConfig ( GPIO_Remap_SWJ_NoJTRST, ENABLE );

	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
	GPIO_WriteBit ( GPIOB, GPIO_Pin_4  , Bit_RESET );

	/* Setup INPUTs */

#ifdef GPIOA_INPUT_FLOAT_MASK
	/* Configure GPIOA Inputs Floating */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_INPUT_FLOAT_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif

#ifdef GPIOB_INPUT_FLOAT_MASK
	/* Configure GPIOB Inputs Floating */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_INPUT_FLOAT_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
#endif

#ifdef GPIOC_INPUT_FLOAT_MASK
	/* Configure GPIOC Inputs Floating */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOC_INPUT_FLOAT_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init ( GPIOC, &GPIO_InitStructure );
#endif

#ifdef GPIOD_INPUT_FLOAT_MASK
	/* Configure GPIOD Inputs Floating */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOD_INPUT_FLOAT_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init ( GPIOD, &GPIO_InitStructure );
#endif


	/* Inputs that are pull downs */

#ifdef GPIOA_INPUT_PULLDOWN_MASK
	/* Configure GPIOA Inputs pulled down */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_INPUT_PULLDOWN_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif

#ifdef GPIOB_INPUT_PULLDOWN_MASK
	/* Configure GPIOB Inputs pulled down */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_INPUT_PULLDOWN_MASK; // drops k1 to 2.67V
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
#endif

#ifdef GPIOC_INPUT_PULLDOWN_MASK
	/* Configure GPIOC Inputs pulled down */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOC_INPUT_PULLDOWN_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	GPIO_Init ( GPIOC, &GPIO_InitStructure );
#endif

#ifdef GPIOD_INPUT_PULLDOWN_MASK
	/* Configure GPIOD Inputs pulled down */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOD_INPUT_PULLDOWN_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	GPIO_Init ( GPIOD, &GPIO_InitStructure );
#endif

	/* Inputs that are pull ups */

#ifdef GPIOA_INPUT_PULLUP_MASK
	/* Configure GPIOA Inputs pulled UP */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_INPUT_PULLUP_MASK; //draging k1 to 2.6v
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif

#ifdef GPIOB_INPUT_PULLUP_MASK
	/* Configure GPIOB Inputs pulled UP */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_INPUT_PULLUP_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
#endif

#ifdef GPIOC_INPUT_PULLUP_MASK
	/* Configure GPIOC Inputs pulled UP */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOC_INPUT_PULLUP_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init ( GPIOC, &GPIO_InitStructure );
#endif

#ifdef GPIOD_INPUT_PULLUP_MASK
	/* Configure GPIOD Inputs pulled UP */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOD_INPUT_PULLUP_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init ( GPIOD, &GPIO_InitStructure );
#endif

#ifdef GPIOB_INPUT_PULLDOWN_MASK
	/* Configure GPIOB Inputs pulled UP */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_INPUT_PULLDOWN_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	//GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
#endif


	/* End INPUTs */

	/* 50Mhz Outputs */

#ifdef GPIOA_OUTPUTS_50MHZ_PP_MASK
	/* Configure GPIOA Outputs (pp) 50Mhz*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_50MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif

#ifdef GPIOA_OUTPUTS_50MHZ_AF_MASK
	/* Configure GPIOA Outputs (AF) 50Mhz*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_50MHZ_AF_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif



#ifdef GPIOB_OUTPUTS_50MHZ_PP_MASK
	/* Configure GPIOB Outputs (pp) */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_OUTPUTS_50MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
#endif

#ifdef GPIOC_OUTPUTS_50MHZ_PP_MASK
	/* Configure GPIOC Outputs (pp) */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOC_OUTPUTS_50MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOC, &GPIO_InitStructure );
#endif

#ifdef GPIOD_OUTPUTS_50MHZ_PP_MASK
	/* Configure GPIOD Outputs (pp) 50MHZ*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOD_OUTPUTS_50MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOD, &GPIO_InitStructure );
#endif


