glocklueng/032/LayerOne_2014/badge/code/stm32-prox/hw_config.c
#ifdef GPIOA_OUTPUTS_50MHZ_OD_MASK
	/* Configure GPIOA Outputs (OD) 50Mhz*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_50MHZ_OD_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif

#ifdef GPIOB_OUTPUTS_50MHZ_OD_MASK
	/* Configure GPIOB Outputs (OD) */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_OUTPUTS_50MHZ_OD_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	TIM_OCInitStructure ( GPIOB, &GPIO_InitStructure );
#endif

#ifdef GPIOC_OUTPUTS_50MHZ_OD_MASK
	/* Configure GPIOC Outputs (pp) */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOC_OUTPUTS_50MHZ_OD_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_Init ( GPIOC, &GPIO_InitStructure );
#endif

#ifdef GPIOD_OUTPUTS_50MHZ_OD_MASK
	/* Configure GPIOD Outputs (OD) 50MHZ*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOD_OUTPUTS_50MHZ_OD_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_Init ( GPIOD, &GPIO_InitStructure );
#endif


	/* 10Mhz Outputs */

#ifdef GPIOA_OUTPUTS_10MHZ_PP_MASK
	/* Configure GPIOA Outputs (pp) 10Mhz*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_10MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif

#ifdef GPIOB_OUTPUTS_10MHZ_PP_MASK
	/* Configure GPIOB Outputs (pp) */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_OUTPUTS_10MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
#endif

#ifdef GPIOC_OUTPUTS_10MHZ_PP_MASK
	/* Configure GPIOC Outputs (pp) */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOC_OUTPUTS_10MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOC, &GPIO_InitStructure );
#endif

#ifdef GPIOD_OUTPUTS_10MHZ_PP_MASK
	/* Configure GPIOD Outputs (pp) 50MHZ*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOD_OUTPUTS_10MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOD, &GPIO_InitStructure );
#endif


	/* 2MHZ Outputs */

#ifdef GPIOA_OUTPUTS_2MHZ_PP_MASK
	/* Configure GPIOA Outputs (pp) 2MHZ*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_OUTPUTS_2MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif

#ifdef GPIOB_OUTPUTS_2MHZ_PP_MASK
	/* Configure GPIOB Outputs (pp) */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_OUTPUTS_2MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
#endif

#ifdef GPIOC_OUTPUTS_2MHZ_PP_MASK
	/* Configure GPIOC Outputs (pp) */
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOC_OUTPUTS_2MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOC, &GPIO_InitStructure );
#endif

#ifdef GPIOD_OUTPUTS_2MHZ_PP_MASK
	/* Configure GPIOD Outputs (pp) 50MHZ*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOD_OUTPUTS_2MHZ_PP_MASK;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init ( GPIOD, &GPIO_InitStructure );
#endif

	/* End OUTPUTS */

	/* Set OUTPUTs default state */

#ifdef GPIOA_DEFAULT_LOW_MASK
	GPIO_ResetBits ( GPIOA, GPIOA_DEFAULT_LOW_MASK );
#endif

#ifdef GPIOA_DEFAULT_HIGH_MASK
	GPIO_SetBits ( GPIOA, GPIOA_DEFAULT_HIGH_MASK );
#endif

#ifdef GPIOB_DEFAULT_LOW_MASK
	GPIO_ResetBits ( GPIOB, GPIOB_DEFAULT_LOW_MASK );
#endif

#ifdef GPIOB_DEFAULT_HIGH_MASK
	GPIO_SetBits ( GPIOB, GPIOB_DEFAULT_HIGH_MASK );
#endif

#ifdef GPIOC_DEFAULT_LOW_MASK
	GPIO_ResetBits ( GPIOC, GPIOC_DEFAULT_LOW_MASK );
#endif

#ifdef GPIOC_DEFAULT_HIGH_MASK
	GPIO_SetBits ( GPIOC, GPIOC_DEFAULT_HIGH_MASK );
#endif

#ifdef GPIOD_DEFAULT_LOW_MASK
	GPIO_ResetBits ( GPIOD, GPIOD_DEFAULT_LOW_MASK );
#endif

#ifdef GPIOD_DEFAULT_HIGH_MASK
	GPIO_SetBits ( GPIOD, GPIOD_DEFAULT_HIGH_MASK );
#endif

	/* End Default States */

	/* ANALOG Setup */

#ifdef GPIOA_ANALOG_MASK
	/* Configure GPIOA analog input -------------------------*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOA_ANALOG_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init ( GPIOA, &GPIO_InitStructure );
#endif

#ifdef GPIOB_ANALOG_MASK
	/* Configure GPIOB analog input -------------------------*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOB_ANALOG_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_Init ( GPIOB, &GPIO_InitStructure );
#endif

#ifdef GPIOC_ANALOG_MASK
	/* Configure GPIOC analog input -------------------------*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOC_ANALOG_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_Init ( GPIOC, &GPIO_InitStructure );
#endif

#ifdef GPIOD_ANALOG_MASK
	/* Configure GPIOD analog input -------------------------*/
	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	GPIO_InitStructure.GPIO_Pin = GPIOD_ANALOG_MASK;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
	GPIO_Init ( GPIOD, &GPIO_InitStructure );
#endif

	/* End ANALOG */
}



