glocklueng/032/LayerOne_2014/badge/code/stm32-prox/hw_config.c
/*******************************************************************************
* Function Name : EXTI_Configuration.
* Description   : Configure the EXTI lines for Key and Tamper push buttons.
* Input         : None.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void EXTI_Configuration ( void )
{
	EXTI_InitTypeDef EXTI_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	memset ( &EXTI_InitStructure,0,sizeof ( EXTI_InitStructure ) );
	memset ( &NVIC_InitStructure,0,sizeof ( NVIC_InitStructure ) );

	/* Enable the APB2 GPIOB Clock */
	RCC_APB2PeriphClockCmd ( RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO, ENABLE );

#if BOARD_REVISION == 3
	/* Connect SSP Frame to the correspondent EXTI line */
	GPIO_EXTILineConfig ( GPIO_PortSourceGPIOB, GPIO_PinSource12 );
#else
	/* Connect SSP Frame to the correspondent EXTI line */
	GPIO_EXTILineConfig ( GPIO_PortSourceGPIOB, GPIO_PinSource1 );
#endif
	
	/* Configure SSP Frame EXTI line to generate an interrupt on rising edges */
	EXTI_InitStructure.EXTI_Line = EXTI_Line1;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init ( &EXTI_InitStructure );

	/* Clear the SSP FRAME EXTI line pending bit */
	EXTI_ClearITPendingBit ( EXTI_Line1 );

#if BOARD_REVISION == 3
	/* Connect SSP CLK to the correspondent EXTI line */
	GPIO_EXTILineConfig ( GPIO_PortSourceGPIOB, GPIO_PinSource9 );
#else
	/* Connect SSP CLK to the correspondent EXTI line */
	GPIO_EXTILineConfig ( GPIO_PortSourceGPIOB, GPIO_PinSource2 );
#endif
	
	/* Configure SW K2 EXTI Line to generate an interrupt rising edges */
	EXTI_InitStructure.EXTI_Line      = EXTI_Line2;
	EXTI_InitStructure.EXTI_Mode      = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger   = EXTI_Trigger_Rising;
	EXTI_InitStructure.EXTI_LineCmd   = ENABLE;
	EXTI_Init ( &EXTI_InitStructure );

	FpgaSetupSsc ( 0 );

	/* Clear the EXTI line pending bit */
	EXTI_ClearITPendingBit ( EXTI_Line2 );

}

/*******************************************************************************
* Function Name : ADC_Configuration.
* Description   : Configure the ADC and DMA.
* Input         : None.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void ADC_Configuration ( void )
{
	ADC_InitTypeDef ADC_InitStructure;

#if DMA_ADC == 1

	DMA_InitTypeDef DMA_InitStructure;

	memset ( &DMA_InitStructure,0,sizeof ( DMA_InitStructure ) );
	memset ( &ADC_InitStructure,0,sizeof ( ADC_InitStructure ) );

	/* Enable DMA1 clock */
	RCC_AHBPeriphClockCmd ( RCC_AHBPeriph_DMA1, ENABLE );

	/* Enable ADC1 clock */
	RCC_APB2PeriphClockCmd ( RCC_APB2Periph_ADC1, ENABLE );

	/* DMA1 channel1 configuration ---------------------------------------------*/
	DMA_DeInit ( DMA1_Channel1 );
	DMA_InitStructure.DMA_PeripheralBaseAddr = ADC1_DR_Address;
	DMA_InitStructure.DMA_MemoryBaseAddr = ( u32 ) &ADC_Ampl[0];
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
	DMA_InitStructure.DMA_BufferSize = 2;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
	DMA_InitStructure.DMA_Priority = DMA_Priority_Low;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init ( DMA1_Channel1, &DMA_InitStructure );

	/* Enable DMA1 channel1 */
	DMA_Cmd ( DMA1_Channel1, ENABLE );

	/* Disable the DMA1 Channel1 Transfer complete interrupt */
	DMA_ITConfig ( DMA1_Channel1, DMA_IT_TC, DISABLE );
#else
	
	/* Enable ADC1 clock */
	RCC_APB2PeriphClockCmd ( RCC_APB2Periph_ADC1, ENABLE );
#endif

	/* ADC1 configuration ------------------------------------------------------*/
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
	
#if DMA_ADC == 1
	ADC_InitStructure.ADC_ScanConvMode = ENABLE;
	ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
#else
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
#endif
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	ADC_InitStructure.ADC_NbrOfChannel = 2;
	ADC_Init ( ADC1, &ADC_InitStructure );

	/* ADC0 regular channel configuration */
	ADC_RegularChannelConfig ( ADC1, ADC_Channel_0, 1, ADC_SampleTime_239Cycles5 );

	/* ADC1 regular channel configuration */
	ADC_RegularChannelConfig ( ADC1, ADC_Channel_1, 2, ADC_SampleTime_239Cycles5 );

#if DMA_ADC == 1

	/* Enable ADC1 DMA */
	ADC_DMACmd ( ADC1, ENABLE );

#endif

	/* Enable ADC1 */
	ADC_Cmd ( ADC1, ENABLE );

	/* Enable ADC1 reset calibaration register */
	ADC_ResetCalibration ( ADC1 );

	/* Check the end of ADC1 reset calibration register */
	while ( ADC_GetResetCalibrationStatus ( ADC1 ) );

	/* Start ADC1 calibaration */
	ADC_StartCalibration ( ADC1 );

	/* Check the end of ADC1 calibration */
	while ( ADC_GetCalibrationStatus ( ADC1 ) );
}

/*******************************************************************************
* Function Name  : Get_SerialNum.
* Description    : Create the serial number string descriptor.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Get_SerialNum ( void )
{
	u32 Device_Serial0, Device_Serial1, Device_Serial2;

	Device_Serial0 = * ( u32* ) ( 0x1FFFF7E8 );
	Device_Serial1 = * ( u32* ) ( 0x1FFFF7EC );
	Device_Serial2 = * ( u32* ) ( 0x1FFFF7F0 );

	return ;

	if ( Device_Serial0 != 0 ) {

		// starts at 2, to skip the length / type
		CustomHID_StringSerial[2] = ( u8 ) ( Device_Serial0 & 0x0000000F );
		CustomHID_StringSerial[4] = ( u8 ) ( ( Device_Serial0 & 0x00000F00 ) >> 8 );
		CustomHID_StringSerial[6] = ( u8 ) ( ( Device_Serial0 & 0x000F0000 ) >> 16 );
		CustomHID_StringSerial[8] = ( u8 ) ( ( Device_Serial0 & 0x0F000000 ) >> 24 );

		CustomHID_StringSerial[10] = ( u8 ) ( Device_Serial1 & 0x0000000F );
		CustomHID_StringSerial[12] = ( u8 ) ( ( Device_Serial1 & 0x00000F00 ) >> 8 );
		CustomHID_StringSerial[14] = ( u8 ) ( ( Device_Serial1 & 0x000F0000 ) >> 16 );
		CustomHID_StringSerial[16] = ( u8 ) ( ( Device_Serial1 & 0x0F000000 ) >> 24 );

		CustomHID_StringSerial[18] = ( u8 ) ( Device_Serial2 & 0x0000000F );
		CustomHID_StringSerial[20] = ( u8 ) ( ( Device_Serial2 & 0x00000F00 ) >> 8 );
		CustomHID_StringSerial[22] = ( u8 ) ( ( Device_Serial2 & 0x000F0000 ) >> 16 );
		CustomHID_StringSerial[24] = ( u8 ) ( ( Device_Serial2 & 0x0F000000 ) >> 24 );
	}
}
/**************************************************************************************/

void RCC_Configuration ( void )
{
	/* --------------------------- System Clocks Configuration -----------------*/
	/* TIM1 clock enable */
	RCC_APB2PeriphClockCmd ( RCC_APB2Periph_TIM1, ENABLE );

	/* GPIOA clock enable */
	//RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
}

/**************************************************************************************
 * Setup the 24Mhz clock
 **************************************************************************************/

void TIM1_Configuration ( void )
{
	TIM_OCInitTypeDef  TIM_OCInitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	uint16_t Period;

	Period = ( SystemCoreClock  / 24000000 ); // Must be divisable

	memset ( &TIM_OCInitStructure,0,sizeof ( TIM_OCInitStructure ) );
	memset ( &TIM_TimeBaseStructure,0,sizeof ( TIM_TimeBaseStructure ) );

	/* Time base configuration */
	TIM_TimeBaseStructure.TIM_Prescaler = 0; // Dump 1X clock into timer
	TIM_TimeBaseStructure.TIM_Period = Period - 1;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit ( TIM1, &TIM_TimeBaseStructure );

	/* Enable TIM1 Preload register on ARR */
	TIM_ARRPreloadConfig ( TIM1, ENABLE );

