glocklueng/032/LayerOne_2014/badge/code/stm32-prox/hw_config.c
	/* TIM PWM1 Mode configuration */
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = Period / 2; // 50%
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;

	/* Output Compare PWM1 Mode configuration: Channel1 PA.08 */
	TIM_OC1Init ( TIM1, &TIM_OCInitStructure );
	TIM_OC1PreloadConfig ( TIM1, TIM_OCPreload_Enable );

	/* TIM1 Main Output Enable */
	TIM_CtrlPWMOutputs ( TIM1, ENABLE );

	/* TIM1 enable counter */
	TIM_Cmd ( TIM1, ENABLE );
}

/*******************************************************************************
* Function Name  : Timer2 configurations
* Description    : Configure Timer2 in such a way that it can initiate data transfer using DMA on
*         rising edge of clock signal received on port pin.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM2_Configuration ( void )
{
  
	GPIO_InitTypeDef   GPIO_InitStructure;
	TIM_ICInitTypeDef  TIM_ICInitStructure;

	memset ( &GPIO_InitStructure,0,sizeof ( GPIO_InitStructure ) );
	memset ( &TIM_ICInitStructure,0,sizeof ( TIM_ICInitStructure ) );

	RCC_APB2PeriphClockCmd ( RCC_APB1Periph_TIM2, ENABLE ); /* TIM2 clock enable */
	//RCC_AHB1PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

	TIM_ICInitStructure.TIM_Channel     = TIM_Channel_2;
	TIM_ICInitStructure.TIM_ICPolarity  = TIM_ICPolarity_Rising;
	TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	TIM_ICInitStructure.TIM_ICFilter    = 0x0;
	TIM_ICInit ( TIM1, &TIM_ICInitStructure );

	TIM_CtrlPWMOutputs ( TIM2, ENABLE );    /* TIM Main Inputs/Output Enable    */
	TIM_Cmd ( TIM2, ENABLE );               /* TIM enable counter               */
	TIM_DMACmd ( TIM2, TIM_DMA_CC1, ENABLE ); /* Enable TIM2_CC1 DMA Requests     */
}

/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/

